#Ввести строку. Вывести на экран букву, которая находится в середине этой строки.
#Также, если эта центральная буква равна первой букве в строке,
#то создать и вывести часть строки между первым и последним символами исходной строки.
#(подсказка: для получения центральной буквы, найдите длину строки и разделите ее пополам.
#Для создания результирующий строки используйте срез)
my_str = input("enter str - ")
lan_my_str = len(my_str)
#print(len(my_str)/2)
index = len(my_str)/2
first_name = my_str
print(first_name[index])












