#Написать игру. Пользователь должен угадать число.
#Сперва вводится диапазон угадывания. После колличество попыток.
#В случае правильного ответа - выводить You are the winner.
#В случае неправильного давать игроку подсказку(больше или меньше искомое число).
#Если за указанное количество попыток число не угадано - выводить: You are the loser и правильное число.
start = int(input("start - "))
finish = int(input("finish - "))
count = int(input("count of attens - "))
result = randin(start, finish)
while True:
    if count = 0
        print("You are the loser i pr cisl {result}")
        break
    attemt = int(input("enter number - "))
    if attemt < result:
        print()
elif attemt = result:
print("You are the loser )
      elif attemt > result: