#Создать список учеников подобной структуры.
#Определить средний балл каждого студента по всем предметам,
#и вывести сведения о студентах, средний балл которых больше 4
pupils = [{'firstname': 'Valera',
         'group' 42,
         'fhis' 7,
         'inf': 4
         'math': 5},
          {'firstname': 'Petia,',
           'group' 42,
           'fhis' 7,
           'inf': 4
           'math': 2},
          {'firstname': 'Boris',
           'group' 42,
           'fhis' 10,
           'inf': 9,
           'math': 7}
for data pupils:
    print(data.items())
print(type(pupils[a])(firstname))

