#Дана целочисленная матрица А[n,m]. Посчитать количество элементов матрицы,
#превосходящих среднее арифметическое значение элементов матрицы и сумма индексов которых четна.
for i, number in enumerate(range(10, 15)):
    print(arr)
n = int(input("enter number - "))
m = int(input("enter number - "))
arr = []
for i in range(n):
    arr_1 = []
    for j in range(n):
        arr_1.append(randint(4, 9))
    #print(arr_1)
    arr.append(arr_1)
print(arr)
    arr = [randit(1, 9) for _ in range(m) for _ in range(n)]
